import pandas as pd


df = pd.DataFrame(columns = ['Item', 'Type','Stat', 'Effect', 'Recipe'])

def insert_item(df, item, type, stat, effect, recipe):
    df = df._append({'Item': item, 'Type': type, 'Stat': stat, 'Effect': effect, 'Recipe': recipe}, ignore_index=True)
    return df
df = insert_item(df,"B.F.대검", '조합', '공격력+10%', '-', '-')
df = insert_item(df,'곡궁', '조합', '공격속도+10%', '-', '-')
df = insert_item(df, '쇠사슬 조끼', '조합', '방어력+20', '-', '-')
df = insert_item(df, '음전자 망토', '조합', '마법저항력+20', '-', '-')
df = insert_item(df, '거인의 허리띠', '조합', '체력+150', '-', '-')
df = insert_item(df, '여신의 눈물', '조합', '마나+15', '-', '-')
df = insert_item(df, '쓸데없이 큰 지팡이', '조합', '주문력+10', '-', '-')
df = insert_item(df, '연습용 장갑', '조합', '치명타 확률+20%', '-', '-')
df = insert_item(df, '뒤집개', '조합', '-', '-', '-')
df = insert_item(df, '프라이팬', '조합', '-', '-', '-')

df = insert_item(df, '죽음의 검', '완성', '공격력+55%', '-', 'B.F.대검 + B.F.대검')
df = insert_item(df, '거인 학살자', '완성', '공격력+25%, 주문력+25%, 공격속도+10%, 피행증폭+5%','최대 체력이 1750 이상인 적을 상대로 피해 증폭을 15% 획득', 'B.F.대검 + 곡궁')
df = insert_item(df, '밤의 끝자락', '완성', '공격력+10%, 방어력+20', '[고유] 전투당 1회: 체력이 60%일 때 잠시 대상으로 지정할 수 없게 되며 해로운 효과 제거. 이후 추가 공격 속도 15% 획득', 'B.F.대검 + 쇠사슬 조끼')
df = insert_item(df, '피바라기', '공격력+15%, 주문력+15, 모든피해흡혈+20%, 마법저항력+20', '전투당 한 번, 체력이 40%일 때 최대 체력의 25%에 해당하는 보호막 획득 후 최대 5초까지 유지', 'B.F.대검 + 음전자 망토')
df = insert_item(df, '마법공학 총검', '완성', '공격력+20%, 주문력+20%, 모든피해흡혈+15%','입힌 피해량의 25%만큼 체력 비율이 가장 낮은 아군의 체력 회복', 'B.F.대검 + 여신의 눈물')
df = insert_item(df, '쇼진의 창', '완성', '공격력+15%, 주문력+15%, 마나+15','기본 공격 시 추가 마나 5 획득', 'B.F.대검 + 여신의 눈물')
df = insert_item(df, '스태락의 도전', '완성', '공격력+15%, 체력+150', '전투당 한 번, 체력이 60%일 때 최대 체력 25% 및 공격력 35% 증가', 'B.F.대검 + 거인의 허리띠')
df = insert_item(df, '무한의 대검', '공격력+35%, 치명타확률+35%', "스킬에 치명타 적용 가능, 기본 스킬에 치명타 적용이 가능한 경우, 대신에 치명타 피해량이 10% 증가", 'B.F.대검 + 연습용 장갑')

df = insert_item(df, '붉은 덩굴 정령', '공격속도+35%, 피해량증가+3%', '기본 공격과 스킬이 5초 동안 적에게 불태우기를 1%, 상처를 33% 적용, 불태우기: 매초 대상 최대 체력의 일정 비율만큼 고정 피해, 상처: 체력 회복량 감소', '곡궁 + 곡궁')
df = insert_item(df, '거인의 결의', '공격속도+10%, 방어력+20', '공격하거나 피해를 받으면 공격력 2%, 주문력 2 증가 (최대 25회 중첩), 최대 중첩 시 방어력 20 및 마법 저항력 20 획득', '곡궁 + 쇠사슬 조끼')
df = insert_item(df, '루난의 허리케인', '공격력+25%, 마법저항력+20, 공격속도+10%', '기본 공격 시 주변 적 하나에게 탄환을 발사하여 공격력의 60%만큼 물리 피해', '곡궁 + 음전자 망토')
df = insert_item(df, '구인수의 격노검', '공격속도+10%, 주문력+10', '공격 시 공격 속도가 5% 증가 (중첩 가능)', '곡궁 + 쓸데없이 큰 지팡이')
df = insert_item(df, '스태틱의 단검', '마나+15, 주문력+15, 공격속도+15%', '3번째 기본 공격마다 적 4명에게 35의 마법 피해를 입히고 5초 동안 30% 파쇄, 파쇄: 마법 저항력 감소', '곡궁 + 여신의 눈물')
df = insert_item(df, '내셔의 이빨', '채력+150, 주문력+10, 공격속도+10%', '스킬 사용 후 5초 동안 공격 속도 60% 증가', '곡궁 + 거인의 허리띠')
df = insert_item(df, '최후의 속삭임', '공격력+15%, 공격속도+20%, 치명타확률+20%', '[고유] 물리 피해를 입힐 경우 3초 동안 30% 파열 (중첩 불가), 파열: 방어력 감소', '곡궁 + 연습용 장갑')

df = insert_item(df, '덤불 조끼', '방어력+65', '7%의 최대 체력 획득, 기본 공격으로 받는 피해 8% 감소. 기본 공격에 맞을 경우 인접한 모든 적에게 100의 마법 피해, 재사용 대기시간: 2초', '쇠사슬 조끼 + 쇠사슬 조끼')
df = insert_item(df, '가고일 돌갑옷', '체력+150, 방어력+25, 마법저항력+25', '적의 공격 대상이 되면 방어력이 10, 마법 저항력이 10 증가. 공격하는 적이 늘어나면 중첩되어 적용.', '쇠사슬 조끼 + 음전자 망토')
df = insert_item(df, '크라운 가드', '체력+100, 주문력+20, 방어력+20', '전투 시작: 8초 동안 최대 체력의 25%에 해당하는 보호막 획득, 보호막이 사라지면 주문력 25 증가', '쇠사슬 조끼 + 쓸데없이 큰 지팡이')
df = insert_item(df, '수호자의 맹세', '마나+30, 방어력+20', '전투당 한 번, 체력이 40%일 때 최대 체력의 25%에 해당하는 보호막 획득 후 5초 동안 유지. 동시에 방어력 20, 마법 저항력 20 획득', '쇠사슬 조끼 + 여신의 눈물')
df = insert_item(df, '태양불꽃 망토', '체력+150, 방어력+20', '[고유] 2초마다 2칸 내에 있는 적 하나에게 10초 동안 불태우기를 1%, 상처를 33% 적용 불태우기: 매초 대상 최대 체력의 일정 비율만큼 고정 피해 상처: 체력 회복량 감소', '쇠사슬 조끼 + 거인의 허리띠')
df = insert_item(df, '굳건한 심장', '체력+200, 방어력+20, 치명타확률 +20%', '내구력 8% 획득. 체력이 50%를 넘으면 대신 내구력 15% 획득', '쇠사슬 조끼 + 연습용 장갑')

df = insert_item(df, '용의 발톱', '마법저항력 +75', '9%의 최대 체력 획득, 2초마다 최대 체력의 2.5% 회복')
df = insert_item(df, '이온 충격기', '체력+150, 주문력+15, 마법저항력+25', '2칸 내 모든 적에게 파쇄 30% 적용. 해당 적이 스킬 사용 시 사용한 마나의 160%에 해당하는 마법 피해를 입음 파쇄: 마법 저항력 감소', '음전자 망토 + 쓸데없이 큰 지팡이')
df = insert_item(df, '적응형 투구', '마나+15, 주문력+10, 마법저항력+20', '전투 시작: 시작 위치에 따라 추가 효과 획득 전방 2열: 방어력과 마법 저항력 40. 기본 공격에 맞으면 마나 1 획득 후방 2열: 주문력 15. 3초마다 마나 10 획득', '음전자 망토 + 여신의 눈물')
 
df.to_csv('item_info.csv', index=False)